{
    "@type": "http://schema.org/Recipe",
    "name": "How to make perfect cheese on toast",
    "description": "This wonderful staple is often overlooked for it's simplicity, but offers a wonderful, warming and nostalgic treat for the tastebuds.",
    "image": "recipe-data/cheese-toast.jpg",
    "prepTime": "PT15M",
    "cookTime": "PT25M",
    "totalTime": "PT40M",
    "recipeYield": "1 person",
    "difficulty": "Easy",
    "cost": "1.52",
    "ingredients": [
        {
            "name": "thick White bread",
            "amountOfThisGood": 2,
            "unit": "slices"
        },
        {
            "@type": "http://schema.org/TypeAndQuantityNode",
            "name": "Mature Cheddar",
            "amountOfThisGood": 200,
            "unit": "GRM"
        },
        {
            "name": "Lea & Perrins",
            "amountOfThisGood": 0.5,
            "unit": "teaspoon"
        },
        {
            "name": "Popping candy",
            "amountOfThisGood": 1,
            "unit": "sprinkle",
            "optional": true
        }
    ],
    "recipeInstructions": [
        {
            "description": "Preheat your grill to the medium setting."
        },
        {
            "description": "Grate or julienne your cheese.",
            "ingredients": [
                "Cheese"
            ]
        },
        {
            "description": "Slice your bread (in this example I’m using a free range open source organic San Francisco sourdough).",
            "ingredients": [
                "Bread"
            ]
        },
        {
            "description": "Remove the half toasted bread and turn it so the untoasted side is facing upwards."
        },
        {
            "description": "Place 100g of cheese on each slice and return to the grill for 3-5 minutes.",
            "ingredients": [
                "Cheese"
            ]
        },
        {
            "description": "Remove your cheese on toast from the grill and add splashes of Lea & Perrins sauce and a sprinkle of popping candy.",
            "ingredients": [
                "Lea & Perrins",
                "Popping candy"
            ]
        },
        {
            "description": "Serve and enjoy."
        }
    ],
    "nutrition": {
        "@type": "http://schema.org/NutritionInformation",
        "calories": 648
    },
    "content": [
        {
            "data": "While marooned on Treasure Island, Ben Gunn sustained himself by dreaming of toasted cheese. It was foremost in his mind upon meeting Jim Hawkins and has propped up many a failing soul in real life as well as great adventure stories."
        },
        {
            "data": "Toasted cheese is curiously particular to eating at home. My father was adamant that the cheese be sliced thinly and overlapped, to melt all the easier. Sliced too thick and scorching was almost certain. What about grated cheese? \"No,\" came the reply. \"Too much falls over the sides while heat fights to the centre of the heap.\""
        },
        {
            "data": "Good white bread of a lighter structure is best. Sourdough burns too easily along the crust. Toast both sides and liberally butter one side. Lay thin slices of cheese over the buttered toast ensuring no bread is left showing, to prevent scorching. Place the slices under a feisty heat and the savoury is complete when the cheese is bubbling. Now add the vital addition of Worcestershire sauce and freshly milled black pepper. Once plated, it must be eaten immediately, the surface bubbling from the heat of the grill."
        },
        {
            "name": "Boodle's Welsh rarebit",
            "data": "The best Welsh rarebit I ever had was when beginning my apprenticeship as a cook in London at Boodle's, a gentleman's club in St James's. The head chef, Keith Podmore, had a recipe that required the considerable reducing of stout which was then thickened in a pan with thoroughly cooked flour and butter, enriched with a great heap of grated cheddar, a dollop of mustard, much Worcestershire sauce, plenty of pepper and a couple of egg yolks. The subject of egg yolk is contentious.'"
        }
    ]
}